In [1]:
from pyspark.sql import SparkSession
import pandas as pd

In [2]:
spark = SparkSession.builder.master('local[*]').getOrCreate()

In [4]:
requests = spark.read.json('data/requests.json').toPandas()

In [5]:
requests.head()

   movie_id  rating    timestamp  user_id
0      2019     NaN  956678777.0     6040
1       759     NaN  956679248.0     6040
2      2858     NaN  956679275.0     6040
3       246     NaN  956679413.0     6040
4      1617     NaN  956679473.0     6040

In [11]:
ratings = spark.read.json('data/ratings.json').toPandas()

In [15]:
ratings.tail()

        movie_id  rating    timestamp  user_id
719944      3198       4  975739907.0      635
719945      2966       4  975739907.0      635
719946      2303       4  975739907.0      635
719947       802       4  975739918.0     1875
719948       892       4  975739919.0     1875

In [6]:
movies = pd.read_csv('movies_dat.csv')

In [8]:
display(movies.head())
movies.tail()

,Unnamed: 0,1,2
0,0,Toy Story (1995),Animation|Children's|Comedy
1,1,Jumanji (1995),Adventure|Children's|Fantasy
2,2,Grumpier Old Men (1995),Comedy|Romance
3,3,Waiting to Exhale (1995),Comedy|Drama
4,4,Father of the Bride Part II (1995),Comedy

      Unnamed: 0                           1               2
3878        3878     Meet the Parents (2000)          Comedy
3879        3879  Requiem for a Dream (2000)           Drama
3880        3880            Tigerland (2000)           Drama
3881        3881     Two Family House (2000)           Drama
3882        3882       Contender, The (2000)  Drama|Thriller